namespace MarketKhoone.ViewModels.FeatureConstantValues;

public class FeatureConstantValueForCreateProductViewModel
{

    public long FeatureId { get; set; }

    public string Value { get; set; }
}

//این ویوو مدل رو چرا ساختیم؟
//در قسمت ایجاد محصول، کاربر میتونه در بخش ویژگی مقادیر ثابت، مثلا تعداد دوربین برای گوشی موبایل
//از داخل سلکت باکشی که ما پرش میکنیم، بیاد و دو عدد رو سلکت کنه...یا مثلا 3 عدد رو
// خلاصه ما اون سلکت باکس رو پر میکنیم، چون جزو ویژگی های ثابته مقدار رو میگیمی بیا و از بین اینا سلکت کن
// اماااااااااااااااااااااااااا 
// کاربر میتونه از طریق اینسپکت زرنگی کنه و به جای دو عدد دوربین، مثلا بفرسته 13000 عدد گوشی
//یعنی این گوشی 13000 تا دوربین داره و ما باید موقعی که حتی مقدار سلکت باکس رو میکیریم
// قبل اضافه کردن چک کنیم، ببینینم اصلا اون مثا تعداد دوربین که گفته دو عدد، اصلا دوعدد در دیتابیس ما هست
// اگر بود اضافه میکنیم
// پس به آیدی اون فیچر نیازی داریم یا مقدار ولیووش